Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: ``"value"``: enumerator value
it_it: ``"value"``: valore dell'enumeratore

source: ``"variable"``: Describes a global variable.
it_it: ``"variable"``: Descrive una variabile globale.

source: ``$evtest /dev/input/event1`` replacing ``eventX`` with your event device from above.
it_it: ``$evtest /dev/input/event1`` sostituendo ``eventX`` con il dispositivo di eventi indicato sopra.

source: ``${WORKDIR}`` is a standard variable in BitBake that points to the working directory for the recipe.
it_it: ``${WORKDIR}`` è una variabile standard in BitBake che punta alla directory di lavoro per la ricetta.

source: ``%`` must be appended to the value as the unit.
it_it: ``%`` deve essere aggiunto al valore come unità.

source: ``&point`` is a pointer to an :cpp:struct:`lv_point_t` variable.
it_it: ``&point`` è un puntatore a una variabile :cpp:struct:`lv_point_t`.

source: ``--develop``: leaves the files generated in the temporary folder in place.
it_it: ``--develop``: lascia i file generati nella cartella temporanea.

source: ``--errorlimit`` default: ``10`` (min 1)
it_it: ``--errorlimit`` per default è ``10`` (min 1)

source: ``--filter-character`` filters out non-ASCII characters and ``--null-terminate`` makes sure that a trailing zero is appended to properly close the string.
it_it: ``--filter-character`` filtra i caratteri non ASCII e ``--null-terminate`` assicura che venga aggiunto uno zero finale per chiudere correttamente la stringa.

source: ``--filter-character`` filters out non-ASCII characters and ``--null-terminate`` makes sure that a trailing zero is appended to properly terminate the string.
it_it: ``--filter-character`` filtra i caratteri non ASCII e ``--null-terminate`` assicura che venga aggiunto uno zero finale per terminare correttamente la stringa.

source: ``--lvgl-config``: path to lv_conf.h (including file name).
it_it: ``--lvgl-config``: path per lv_conf.h (incluso il nome del file).

source: ``--output-path``: output directory for JSON file.
it_it: ``--output-path``: directory di output per il file JSON.

source: ``--target <web|node>`` – compile target (``compile``)
it_it: ``--target <web|node>`` – target della compilazione (``compile``)

source: ``--target`` defaults to ``web`` (choices: ``web``, ``node``)
it_it: ``--target`` per default è ``web`` (scelte: ``web``, ``node``)

source: ``-1``: get the last created child
it_it: ``-1``: si ottiene l'ultimo elemento figlio creato

source: ``-`` is used to create compound names, e.g. ``lv_chart-series``
it_it: ``-`` viene utilizzato per creare nomi composti, ad esempio ``lv_chart-series``

source: ``-l, --errorlimit <n>`` – max errors shown (``validate``)
it_it: ``-l, --errorlimit <n>`` – numero massimo di errori visualizzati (``validate``)

source: ``-ss, --start-service`` – prepare/refresh container image before running
it_it: ``-ss, --start-service`` – prepara/aggiorna l'immagine del container prima dell'esecuzione

source: ``0`` is the oldest child's position, ``-1`` is the youngest.
it_it: ``0`` è la posizione del widget figlio più vecchio, ``-1`` è la posizione del widget figlio più giovane.

source: ``0``: get the first created child
it_it: ``0``: si ottiene il primo elemento figlio creato

source: ``100%`` means the parent's content area (the size excluding padding and border).
it_it: ``100%`` indica l'area del contenuto del genitore (la dimensione escludendo padding e bordo).

source: ``1``: get the second created child
it_it: ``1``: si ottiene il secondo elemento figlio creato

source: ``<arg>``\s are required and used when creating/getting the element.
it_it: Gli ``<arg>`` sono obbligatori e utilizzati durante la creazione/acquisizione dell'elemento.

source: ``<bin>`` fonts require these properties:
it_it: I font ``<bin>`` richiedono queste proprietà:

source: ``<body>`` optional and can be used to describe the details of this change.
it_it: ``<body>`` è facoltativo e può essere utilizzato per descrivere i dettagli di questa modifica.

source: ``<click_at x="10" y="30"/>``: Simulates a click at the specified screen coordinates.
it_it: ``<click_at x="10" y="30"/>``: Simula un clic alle coordinate dello schermo specificate.

source: ``<component>``: can extend both ``<widget>``\ s and ``<component>``\ s
it_it: ``<component>``: può estendere sia i ``<widget>`` che i ``<component>``

source: ``<component>``\ s
it_it: nei ``<component>``

source: ``<component>``\ s support the following child XML tags:
it_it: I ``<component>`` supportano i seguenti tag XML figli:

source: ``<enumdef>`` can be used in the ``<api>`` tags to create custom enums for **Widgets**.
it_it: ``<enumdef>`` può essere utilizzato nei tag ``<api>`` per creare enumerazioni personalizzate per i **Widgets**.

source: ``<footer>`` shall contain:
it_it: ``<footer>`` deve contenere:

source: ``<freeze ms="100"/>``: Pauses the UI and LVGL's internal time.
it_it: ``<freeze ms="100"/>``: Mette in pausa l'interfaccia utente e il tempo interno di LVGL.

source: ``<include_timeline>`` also can be used in ``<timeline>``\ s to "merge" the animations of another timeline.
it_it: ``<include_timeline>`` è utilizzabile anche nei ``<timeline>`` per il "merge" delle animazioni di un'altra timeline.

source: ``<lv_obj-bind_flag_if_eq>`` — Set a flag if the subject's value **equals** the reference value.
it_it: ``<lv_obj-bind_flag_if_eq>`` — Imposta un flag se il valore del soggetto **è uguale** al valore di riferimento.

source: ``<lv_obj-bind_flag_if_ge>`` — Set a flag if the subject's value is **greater than or equal to** the reference value.
it_it: ``<lv_obj-bind_flag_if_ge>`` — Imposta un flag se il valore del soggetto è **maggiore o uguale al** valore di riferimento.

source: ``<lv_obj-bind_flag_if_gt>`` — Set a flag if the subject's value is **greater than** the reference value.
it_it: ``<lv_obj-bind_flag_if_gt>`` — Imposta un flag se il valore del soggetto è **maggiore del** valore di riferimento.

source: ``<lv_obj-bind_flag_if_le>`` — Set a flag if the subject's value is **less than or equal to** the reference value.
it_it: ``<lv_obj-bind_flag_if_le>`` — Imposta un flag se il valore del soggetto è **inferiore o uguale al** valore di riferimento.

source: ``<lv_obj-bind_flag_if_lt>`` — Set a flag if the subject's value is **less than** the reference value.
it_it: ``<lv_obj-bind_flag_if_lt>`` — Imposta un flag se il valore del soggetto è **inferiore al** valore di riferimento.

source: ``<lv_obj-bind_flag_if_not_eq>`` — Set a flag if the subject's value **does not equal** the reference value.
it_it: ``<lv_obj-bind_flag_if_not_eq>`` — Imposta un flag se il valore del soggetto **non è uguale** al valore di riferimento.

source: ``<lv_obj-bind_state_if_eq>`` — Set a state if the subject's value **equals** the reference value.
it_it: ``<lv_obj-bind_state_if_eq>`` — Imposta uno stato se il valore del soggetto è **uguale al** il valore di riferimento.

source: ``<lv_obj-bind_state_if_ge>`` — Set a state if the subject's value is **greater than or equal to** the reference value.
it_it: ``<lv_obj-bind_state_if_ge>`` — Imposta uno stato se il valore del soggetto è **maggiore o uguale al** valore di riferimento.

source: ``<lv_obj-bind_state_if_gt>`` — Set a state if the subject's value is **greater than** the reference value.
it_it: ``<lv_obj-bind_state_if_gt>`` — Imposta uno stato se il valore del soggetto è **maggiore del** valore di riferimento.

source: ``<lv_obj-bind_state_if_le>`` — Set a state if the subject's value is **less than or equal to** the reference value.
it_it: ``<lv_obj-bind_state_if_le>`` — Imposta uno stato se il valore del soggetto è **minore o uguale al** valore di riferimento.

source: ``<lv_obj-bind_state_if_lt>`` — Set a state if the subject's value is **less than** the reference value.
it_it: ``<lv_obj-bind_state_if_lt>`` — Imposta uno stato se il valore del soggetto è **minore del** valore di riferimento.

source: ``<lv_obj-bind_state_if_not_eq>`` — Set a state if the subject's value **does not equal** the reference value.
it_it: ``<lv_obj-bind_state_if_not_eq>`` — Imposta uno stato se il valore del soggetto è **non uguale al** valore di riferimento.

source: ``<move_to x="10" y="30"/>``: Move the mouse to the specified screen coordinates.
it_it: ``<move_to x="10" y="30"/>``: Sposta il mouse alle coordinate dello schermo specificate.

source: ``<press/>``: Press on the current screen coordinate.
it_it: ``<press/>``: Preme sulla coordinata dello schermo corrente.

source: ``<project-path>`` – path to an LVGL Editor project
it_it: ``<project-path>`` – path di un progetto LVGL Editor

source: ``<project_name>`` is the name of the parent folder by default, which can be overwritten in ``project.xml`` as ``<project name="my_project">``.
it_it: ``<project_name>`` è il nome di default della cartella padre, che può essere sovrascritto in ``project.xml`` come ``<project name="my_project">``.

source: ``<prop>``\ s are simply forwarded to Widget or Component APIs.
it_it: I ``<prop>`` vengono semplicemente inoltrati alle API dei Widget o dei Componenti.

source: ``<prop>``\s are optional and mapped to setters.
it_it: I ``<prop>`` sono opzionali e mappati ai setter.

source: ``<release/>``: Release on the current screen coordinate.
it_it: ``<release/>``: Rilascia sulla coordinata dello schermo corrente.

source: ``<scope>`` is the name of the module, file, or subsystem affected by the commit.
it_it: ``<scope>`` è il nome del modulo, file o sottosistema interessato dal commit.

source: ``<screen>``: cannot extend anything
it_it: ``<screen>``: non può estendere nulla

source: ``<screen>``\ s
it_it: negli ``<screen>``

source: ``<screenshot_compare path="path/to/image.png"/>``: Compares the current screen with a reference image.
it_it: ``<screenshot_compare path="path/to/image.png"/>``: Confronta la schermata corrente con un'immagine di riferimento.

source: ``<selector>`` is an OR-ed value of parts and state to which the style should be added.
it_it: ``<selector>`` è un valore OR tra le parti e lo stato a cui aggiungere lo stile.

source: ``<subject>`` contains a short description of the change following these guidelines:
it_it: ``<subject>`` contiene una breve descrizione della modifica seguendo queste linee guida:

source: ``<subject_compare subject="subject1" value="10">`` Compare an integer or strings subject's value against a reference value.
it_it: ``<subject_compare subject="subject1" value="10">`` Confronta un valore intero o stringa per l'oggetto con un valore di riferimento.

source: ``<subject_set subject="subject1" value="5>`` Set an integer or string subject's value.
it_it: ``<subject_set subject="subject1" value="5>`` Imposta un valore intero o stringa per l'oggetto.

source: ``<test>``: can extend ``<widget>``, ``<component>``, or ``<screen>``
it_it: ``<test>``: può estendere ``<widget>``, ``<component>`` o ``<screen>``

source: ``<test>``\ s
it_it: nei ``<test>``

source: ``<testing-file>`` – test XML relative to ``<project-path>`` (``run-test``)
it_it: ``<testing-file>`` – XML di test relativo a ``<project-path>`` (``run-test``)

source: ``<wait ms="100"/>``: Waits for the given number of milliseconds.
it_it: ``<wait ms="100"/>``: Attende il numero di millisecondi specificato.

source: ``<widget>``: can extend only ``<widget>``\ s
it_it: ``<widget>``: può estendere solo i ``<widget>``

source: ``<widget>``\ s
it_it: nei ``<widget>``

source: ``<widget>``\s support the following child XML tags:
it_it: I tag ``<widget>`` supportano i seguenti tag XML figlio:

source: ``<widget_name>.c`` contains three hooks:
it_it: ``<widget_name>.c`` contiene tre hook:

source: ``@code{.c}/@endcode`` surrounds code that should be placed in a code block.
it_it: ``@code{.c}/@endcode`` racchiude il codice che deve essere inserito in un blocco di codice.

source: ``@file`` tells Doxygen to parse this file and also supplies documentation about the file itself when applicable (everything following it in the same comment).
it_it: ``@file`` indica a Doxygen di analizzare questo file e, se applicabile, fornisce anche la documentazione sul file stesso (tutto ciò che lo segue nello stesso commento).

source: ``@note text`` starts a paragraph where a note can be entered.
it_it: ``@note text`` inizia un paragrafo in cui è possibile inserire una nota.

source: ``@param name description`` documents ``name`` as a function parameter, and ``description`` is the text that follows it until Doxygen encounters a blank line or another Doxygen command.
it_it: ``@param name description`` documenta ``name`` come parametro di funzione, e ``description`` è il testo che lo segue finché Doxygen non incontra una riga vuota o un altro comando Doxygen.

source: ``@param[out] param_name description``.
it_it: ``@param[out] param_name descrizione``.

source: ``@return description`` documents the return value until Doxygen encounters a blank line or another Doxygen command.
it_it: ``@return description`` documenta il valore di ritorno finché Doxygen non incontra una riga vuota o un altro comando Doxygen.

source: ``@see text`` generates a "See also" paragraph in a highlighted section, helpful when additional information about a topic can be found elsewhere.
it_it: ``@see text`` genera un paragrafo "See also" [Vedere anche] in una sezione evidenziata, utile quando si trovano altrove delle informazioni aggiuntive su un argomento.

source: ``A`` and ``B`` will occupy 100 px, and ``C`` will occupy 200 px.
it_it: ``A`` e ``B`` occuperanno 100 px, e ``C`` occuperà 200 px.

source: ``A`` with grow = 1
it_it: ``A`` con grow = 1

source: ``Any character`` Add the character to the current cursor position
it_it: ``Any character`` Aggiunge il carattere alla posizione corrente del cursore

source: ``B`` with grow = 1
it_it: ``B`` con grow = 1

source: ``C`` with grow = 2
it_it: ``C`` con grow = 2

source: ``Container``: occupies full area of File Explorer (Flex grow 1)
it_it: ``Container``: occupa l'intera area di File Explorer (Flex grow 1)

source: ``Device List``: grows to accommodate children
it_it: ``Device List``: si espande per contenere i sotto-elementi

source: ``Documents``: button
it_it: -__``Documents``: pulsante

source: ``EFI_ABSOLUTE_POINTER_PROTOCOL_GUID``: for touch support
it_it: ``EFI_ABSOLUTE_POINTER_PROTOCOL_GUID``: per il supporto touch

source: ``EFI_EDID_ACTIVE_PROTOCOL_GUID``: for drawing (optional)
it_it: ``EFI_EDID_ACTIVE_PROTOCOL_GUID``: per il disegno (facoltativo)

source: ``EFI_GRAPHICS_OUTPUT_PROTOCOL_GUID``: for drawing
it_it: ``EFI_GRAPHICS_OUTPUT_PROTOCOL_GUID``: per il disegno

source: ``EFI_LOADED_IMAGE_PROTOCOL_GUID``: for file system support (used to determine the file system used to load the application)
it_it: ``EFI_LOADED_IMAGE_PROTOCOL_GUID``: per il supporto del file system (utilizzato per determinare il file system utilizzato per caricare l'applicazione)

source: ``EFI_SIMPLE_FILE_SYSTEM_PROTOCOL_GUID``: for file system support
it_it: ``EFI_SIMPLE_FILE_SYSTEM_PROTOCOL_GUID``: per il supporto del file system

source: ``EFI_SIMPLE_POINTER_PROTOCOL_GUID``: for mouse support
it_it: ``EFI_SIMPLE_POINTER_PROTOCOL_GUID``: per il supporto del mouse

source: ``EFI_SIMPLE_TEXT_INPUT_EX_PROTOCOL_GUID``: for keyboard support
it_it: ``EFI_SIMPLE_TEXT_INPUT_EX_PROTOCOL_GUID``: per il supporto della tastiera

source: ``File Explorer``: occupies full area of parent Widget, typically a Screen (Flex-Flow COLUMN)
it_it: ``File Explorer``: occupa l'intera area del Widget genitore, in genere uno Screen (Flex-Flow COLUMN)

source: ``File System``: button
it_it: -__``File System``: pulsante

source: ``File Table``: with 1 column, 86% of ``Browser Panel`` height
it_it: ``File Table``: con 1 colonna, 86% dell'altezza del ``Browser Panel``

source: ``HOME``: button
it_it: -__``HOME``: pulsante

source: ``Header``: 14% of ``Browser Panel`` height
it_it: ``Header``: 14% dell'altezza del ``Browser Panel``

source: ``LV_BUTTONMATRIX_CTRL_...`` values can be bit-wise OR-ed together when passed to these functions.
it_it: I valori di ``LV_BUTTONMATRIX_CTRL_...`` possono essere combinati tramite OR bit a bit quando vengono passati a queste funzioni.

source: ``LV_CACHE_DEF_SIZE`` is a cache size in bytes.
it_it: ``LV_CACHE_DEF_SIZE`` è la dimensione della cache in byte.

source: ``LV_COLOR_DEPTH`` should be set either to ``32`` or ``16`` in ``lv_conf.h``
it_it: ``LV_COLOR_DEPTH`` dovrebbe essere impostato su ``32`` o su ``16`` in ``lv_conf.h``

source: ``LV_DRAW_LABEL_NO_TXT_SEL`` means no selection.
it_it: ``LV_DRAW_LABEL_NO_TXT_SEL`` significa nessuna selezione.

source: ``LV_GLTF_ANIM_SPEED_NORMAL`` equals 1000, representing 1.0x (normal) speed
it_it: ``LV_GLTF_ANIM_SPEED_NORMAL`` è uguale a 1000, che rappresenta una velocità 1,0x (normale)

source: ``LV_GRID_CONTENT`` tracks on the grid are not handled in the sub-grid, only in its own grid.
it_it: ``LV_GRID_CONTENT`` le track sulla grid non vengono gestite nella sub-grid, ma solo nella propria grid.

source: ``LV_GSTREAMER_STATE_NULL``: Initial state, no media loaded
it_it: ``LV_GSTREAMER_STATE_NULL``: Stato iniziale, nessun contenuto multimediale caricato.

source: ``LV_GSTREAMER_STATE_PAUSED``: Playback paused
it_it: ``LV_GSTREAMER_STATE_PAUSED``: Riproduzione in pausa.

source: ``LV_GSTREAMER_STATE_PLAYING``: Active playback
it_it: ``LV_GSTREAMER_STATE_PLAYING``: In riproduzione.

source: ``LV_GSTREAMER_STATE_READY``: Media loaded and ready to play
it_it: ``LV_GSTREAMER_STATE_READY``: Contenuto multimediale caricato e pronto per la riproduzione.

source: ``LV_INDEV_GESTURE_STATE_ENDED``: The gesture has ended.
it_it: ``LV_INDEV_GESTURE_STATE_ENDED``: Il gesto è terminato.

source: ``LV_INDEV_GESTURE_STATE_RECOGNIZED``: The gesture has been recognized and is now active.
it_it: ``LV_INDEV_GESTURE_STATE_RECOGNIZED``: Il gesto è stato riconosciuto ed è ora attivo.

source: ``LV_KEY_DOWN/LEFT`` Decrement Slider's value by 1.
it_it: ``LV_KEY_DOWN/LEFT`` Decrementa il valore dello Slider di 1.

source: ``LV_KEY_DOWN/LEFT`` Turns Switch OFF
it_it: ``LV_KEY_DOWN/LEFT`` Spegne lo Switch

source: ``LV_KEY_DOWN/UP/LEFT/RIGHT`` To navigate among the buttons to dates
it_it: ``LV_KEY_DOWN/UP/LEFT/RIGHT`` Per navigare tra i pulsanti fino alle date

source: ``LV_KEY_LEFT/DOWN`` Decreases value by one.
it_it: ``LV_KEY_LEFT/DOWN`` Diminuisce il valore di uno.

source: ``LV_KEY_LEFT/DOWN`` Go to non-CHECKED state if Checkbox is enabled
it_it: ``LV_KEY_LEFT/DOWN`` Passa allo stato non-CHECKED se la Checkbox è abilitata

source: ``LV_KEY_LEFT/DOWN`` Go to un-CHECKED state if :cpp:enumerator:`LV_OBJ_FLAG_CHECKABLE` is enabled.
it_it: ``LV_KEY_LEFT/DOWN`` Passa allo stato non CHECKED se :cpp:enumerator:`LV_OBJ_FLAG_CHECKABLE` è abilitato.

source: ``LV_KEY_LEFT/RIGHT`` With *Keypad* move the cursor left/right.
it_it: ``LV_KEY_LEFT/RIGHT`` Con il *tastierino numerico* sposta il cursore a sinistra/destra.

source: ``LV_KEY_LEFT/UP`` Select previous list item.
it_it: ``LV_KEY_LEFT/UP`` Seleziona l'elemento precedente dell'elenco.

source: ``LV_KEY_LEFT/UP`` Select previous option
it_it: ``LV_KEY_LEFT/UP`` Seleziona l'opzione precedente

source: ``LV_KEY_RIGHT/DOWN`` Select next list item.
it_it: ``LV_KEY_RIGHT/DOWN`` Seleziona l'elemento successivo dell'elenco.

source: ``LV_KEY_RIGHT/DOWN`` Select next option
it_it: ``LV_KEY_RIGHT/DOWN`` Seleziona l'opzione successiva

source: ``LV_KEY_RIGHT/LEFT/UP/DOWN/`` Select a cell.
it_it: ``LV_KEY_RIGHT/LEFT/UP/DOWN/`` Seleziona una cella.

source: ``LV_KEY_RIGHT/UP/LEFT/RIGHT`` To navigate among the buttons to select one
it_it: ``LV_KEY_RIGHT/UP/LEFT/RIGHT`` Per navigare tra i pulsanti e selezionarne uno

source: ``LV_KEY_RIGHT/UP/LEFT/RIGHT`` To navigate among the buttons, selecting the one navigated to.
it_it: ``LV_KEY_RIGHT/UP/LEFT/RIGHT`` Per navigare tra i pulsanti, selezionando quello desiderato.

source: ``LV_KEY_RIGHT/UP`` Go to CHECKED state if :cpp:enumerator:`LV_OBJ_FLAG_CHECKABLE` is enabled.
it_it: ``LV_KEY_RIGHT/UP`` Passa allo stato CHECKED se :cpp:enumerator:`LV_OBJ_FLAG_CHECKABLE` è abilitato.

source: ``LV_KEY_RIGHT/UP`` Go to CHECKED state if Checkbox is enabled
it_it: ``LV_KEY_RIGHT/UP`` Passa allo stato CHECKED se la Checkbox è abilitata

source: ``LV_KEY_RIGHT/UP`` Increases value by one.
it_it: ``LV_KEY_RIGHT/UP`` Aumenta il valore di uno.

source: ``LV_KEY_UP/DOWN/LEFT/RIGHT`` Move the cursor
it_it: ``LV_KEY_UP/DOWN/LEFT/RIGHT`` Sposta il cursore

source: ``LV_KEY_UP/DOWN`` With *Keypad* and *Encoder* increment/decrement the value.
it_it: ``LV_KEY_UP/DOWN`` Con *tastierino numerico* e *Encoder* incrementa/decrementa il valore.

source: ``LV_KEY_UP/RIGHT`` Increment Slider's value by 1.
it_it: ``LV_KEY_UP/RIGHT`` Incrementa il valore dello Slider di 1.

source: ``LV_KEY_UP/RIGHT`` Turns Switch ON
it_it: ``LV_KEY_UP/RIGHT`` Accende lo Switch

source: ``LV_LOG(text)`` is similar to ``LV_LOG_USER`` but has no extra information added.
it_it: ``LV_LOG(text)`` è simile a ``LV_LOG_USER`` ma senza aggiungere informazioni aggiuntive.

source: ``LV_USE_DEMO_VECTOR_GRAPHIC`` is a demo you can enable which draws some vector graphics shapes.
it_it: ``LV_USE_DEMO_VECTOR_GRAPHIC`` è una demo abilitabile e che disegna alcune forme grafiche vettoriali.

source: ``LittleFS`` has extra dependencies that should be added to ``main/idf_component.yml``
it_it: ``LittleFS`` ha dipendenze aggiuntive che devono essere inserite in ``main/idf_component.yml``

source: ``Music``: button
it_it: -__``Music``: pulsante

source: ``NULL`` to clear main and clear Menu history.
it_it: ``NULL`` per cancellare il main e la cronologia del Menù.

source: ``NULL`` to clear sidebar.
it_it: ``NULL`` per cancellare la barra laterale.

source: ``PART`` indicates which single :ref:`PART <lv_scale_parts_and_styles>` of the parent Scale it will apply to, namely :cpp:enumerator:`LV_PART_MAIN`, :cpp:enumerator:`LV_PART_ITEMS` or :cpp:enumerator:`LV_PART_INDICATOR`.
it_it: ``PART`` indica a quale singola :ref:`PARTE <lv_scale_parts_and_styles>` della "Scale" padre verrà applicato, ovvero :cpp:enumerator:`LV_PART_MAIN`, :cpp:enumerator:`LV_PART_ITEMS` o :cpp:enumerator:`LV_PART_INDICATOR`.

source: ``PR needed``: We investigated the issue but it still needs to be implemented
it_it: ``PR needed``: Abbiamo esaminato il problema, ma deve ancora essere implementato

source: ``Pictures``: button
it_it: -__``Pictures``: pulsante

source: ``Places List``: grows to accommodate children
it_it: ``Places List``: si espande per contenere i sotto-elementi

source: ``R7FA6M3AH`` for EK-RA6M3G
it_it: ``R7FA6M3AH`` per EK-RA6M3G

source: ``R7FA8D1BH`` for EK-RA8D1
it_it: ``R7FA8D1BH`` per EK-RA8D1

source: ``Review needed``: A Pull request is opened and it needs review/testing
it_it: ``Review needed``: È stata aperta una Pull Request che necessita di revisione/test

source: ``Simple``: Good choice to get started with an LVGL contribution
it_it: ``Simple``: Ottima scelta per iniziare con un contributo LVGL

source: ``TFT_eSPI`` is used as the display driver.
it_it: ``TFT_eSPI`` viene utilizzato come driver del display.

source: ``Video``: button
it_it: -__``Video``: pulsante

source: ``add``: Create multiple elements dynamically.
it_it: ``add``: Crea più elementi dinamicamente.

source: ``align`` can be any of these values:
it_it: ``align`` può assumere uno qualsiasi di questi valori:

source: ``all``: Architecture-independent files.
it_it: ``all``: File indipendenti dall'architettura.

source: ``alldefconfig``: Creates a .config with all default values.
it_it: ``alldefconfig``: Crea un file .config con tutti i valori di default.

source: ``alloc`` allocate
it_it: ``alloc`` allocazione
